programmingTutorial09/programmingTutorial09/testCase/001-cavitatingTransportFoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 ];

internalField   uniform ( 0 -0.00425 0 );

boundaryField
{
    inlet
    {
        type            fixedValue;
 	    value           $internalField;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi;
        value           $internalField;
    }
    wall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
