programmingTutorial09/programmingTutorial09/testCase/001-cavitatingTransportFoam/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0)   	//0
    (6.06 0 0) 	//1
    (6.06 -8 0) //2
    (8 -8 0)  	//3
    (8 0 0)	//4
    (8 8 0)	//5
    (6.06 8 0)	//6
    (0 8 0)	//7



    (0 0 1.94)     //8
    (6.06 0 1.94)  //9
    (6.06 -8 1.94) //10
    (8 -8 1.94)  	//11
    (8 0 1.94)	//12
    (8 8 1.94)	//13
    (6.06 8 1.94)	//14
    (0 8 1.94)	//15
);

blocks
(
    hex (0 1 6 7 8 9 14 15) (30 40 10) simpleGrading (1 1 1)
    hex (1 4 5 6 9 12 13 14) (10 40 10) simpleGrading (1 1 1)
    hex (2 3 4 1 10 11 12 9) (10 40 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    
   inlet
     {
          type patch;
          faces
          (
              (5 6 14 13)
              (6 7 15 14)
          ); 
     }

    outlet
     {
          type patch;
          faces
          (
              (2 3 11 10)
          );

	}

    wall
    {
        type wall;
        faces
        (
          //face walls  
            (0 7 6 1)
            (1 6 5 4)
            (2 1 4 3)
          
          //right walls
            (3 4 12 11)
            (4 5 13 12)

         //left walls
	    (7 0 8 15)
            (1 2 10 9)	
  
          //down wall
	    (0 1 9 8)

        //back walls  
            (8 9 14 15)
            (9 12 13 14)
            (10 11 12 9)

        );
    }
    
);



// ************************************************************************* //
